In [1]:
import os
import pandas as pd
import numpy as np

In [ ]:
os.getcwd()
csv_path = os.path.join(os.getcwd(), "..", "..","..","data", "StudentsPerformance.csv")

df_exams = pd.read_csv(csv_path)

c:\Users\Giacomo Da Re\git\Python_DataScience\modules\2.Numpy_Pandas_Introduction\notebooks

In [4]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

##### 1. HEAD -> First Five

In [5]:
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [7]:
df_exams.head(19)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50
10,male,group C,associate's degree,standard,none,58,54,52
11,male,group D,associate's degree,standard,none,40,52,43
12,female,group B,high school,standard,none,65,81,73
13,male,group A,some college,standard,completed,78,72,70
14,female,group A,master's degree,standard,none,50,53,58
15,female,group C,some high school,standard,none,69,75,78
16,male,group C,high school,standard,none,88,89,86
17,female,group B,some high school,free/reduced,none,18,32,28
18,male,group C,master's degree,free/reduced,completed,46,42,46

##### 2. TAIL -> Last Five

In [6]:
df_exams.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [8]:
df_exams.tail(12)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
988,female,group A,some high school,free/reduced,none,44,45,45
989,female,group D,some college,free/reduced,completed,67,86,83
990,male,group E,high school,free/reduced,completed,86,81,75
991,female,group B,some high school,standard,completed,65,82,78
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
994,male,group A,high school,standard,none,63,63,62
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

##### SHAPE ATTRIBUTES

In [ ]:
df_exams.shape

(1000, 8)

In [ ]:
df_exams.shape[0]

1000

In [ ]:
df_exams.shape[1]

8

###### OPTIONS

In [ ]:
pd.set_option("display.max_rows", 1000)
df_exams

##### 3. SELECTING ONE COLUMN

###### 3.1 FIRST METHOD

In [8]:
df_exams["gender"]

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [9]:
type(df_exams["gender"])

pandas.core.series.Series

###### SERIES

In [12]:
gender = df_exams["gender"]
gender.head()
gender.index

RangeIndex(start=0, stop=1000, step=1)

###### 3.2 SECOND METHOD

In [13]:
df_exams.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [ ]:
df_exams.math score 
# Of course that doesn't work

##### 4. SELECTING TWO COLUMNS

In [15]:
df_exams[["gender", "math score"]]

     gender  math score
0    female          72
1    female          69
2    female          90
3      male          47
4      male          76
..      ...         ...
995  female          88
996    male          62
997  female          59
998  female          68
999  female          77

[1000 rows x 2 columns]

In [16]:
df_exams[["math score", "gender"]]

     math score  gender
0            72  female
1            69  female
2            90  female
3            47    male
4            76    male
..          ...     ...
995          88  female
996          62    male
997          59  female
998          68  female
999          77  female

[1000 rows x 2 columns]

In [17]:
type(df_exams[["gender", "math score"]])

pandas.core.frame.DataFrame

In [20]:
three_columns = df_exams[["gender", "math score", "lunch"]]
three_columns

     gender  math score         lunch
0    female          72      standard
1    female          69      standard
2    female          90      standard
3      male          47  free/reduced
4      male          76      standard
..      ...         ...           ...
995  female          88      standard
996    male          62  free/reduced
997  female          59  free/reduced
998  female          68      standard
999  female          77  free/reduced

[1000 rows x 3 columns]